<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [9]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [10]:
query_3_1 = f'''select count(v.id)
                from public.vacancies v
             '''

In [11]:
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_42568\3851344990.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

In [16]:
# текст запроса
query_3_1 = f'''select count(v.id)
                from public.vacancies v
            '''

In [25]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [18]:
# текст запроса
query_3_2 = f'''select count(e.id)
                from public.employers e
            '''

In [26]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [27]:
# текст запроса
query_3_3 = f'''select count(a.id)
            from public.areas a
            '''

In [28]:
# результат запроса
result_3_3 = pd.read_sql_query(query_3_3, connection)
result_3_3

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\2326570035.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_3_3 = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [29]:
# текст запроса
query_3_4 = f'''select count(i.id)
                from public.industries i
                '''

In [30]:
# результат запроса
result_3_4 = pd.read_sql_query(query_3_4, connection)
result_3_4

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\883928920.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_3_4 = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [38]:
# текст запроса
query_4_1 = f'''select a.name area,
                        count(v.id) cnt
                  from public.vacancies v
                        join public.areas a on v.area_id = a.id
                  group by a.name
                  order by cnt desc
               '''

In [39]:
# результат запроса
result_4_1_df = pd.read_sql_query(query_4_1, connection)
result_4_1_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\2052872682.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_1_df = pd.read_sql_query(query_4_1, connection)

                area   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [40]:
# текст запроса
query_4_2 = f''' select count(v.id)
                from public.vacancies v
                where v.salary_from is not null or v.salary_to is not null
            '''

In [41]:
# результат запроса
result_4_2 = pd.read_sql_query(query_4_2, connection)
result_4_2

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\682357497.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_2 = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [42]:
# текст запроса
query_4_3 = f''' select avg(v.salary_from) avg_from,
                        avg(v.salary_to) avg_to
                 from public.vacancies v
             '''

In [43]:
# результат запроса
result_4_3 = pd.read_sql_query(query_4_3, connection)
result_4_3

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\2925693122.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_3 = pd.read_sql_query(query_4_3, connection)

       avg_from         avg_to
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [46]:
# текст запроса
query_4_4 = f''' select v.schedule,
                        v.employment,
                        count(v.id) cnt
                 from public.vacancies v
                 group by v.schedule, v.employment
                 order by cnt desc
             '''

In [47]:
# результат запроса
result_4_4_df = pd.read_sql_query(query_4_4, connection)
result_4_4_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\495286645.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_4_df = pd.read_sql_query(query_4_4, connection)

            schedule           employment    cnt
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [51]:
# текст запроса
query_4_5 = f''' select v.experience,
                        count(v.id) cnt
                 from public.vacancies v
                 group by v.experience
                 order by cnt asc
             '''

In [52]:
# результат запроса
result_4_5_df = pd.read_sql_query(query_4_5, connection)
result_4_5_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\456848966.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_4_5_df = pd.read_sql_query(query_4_5, connection)

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [57]:
# текст запроса
query_5_1 = f'''select e.name company,
                       count(v.id) cnt
                from public.vacancies v 
                     join public.employers e on v.employer_id = e.id
                group by e.id
                order by cnt desc
                limit 5
            '''

In [ ]:
# результат запроса
result_5_1_df = pd.read_sql_query(query_5_1, connection)
result_5_1_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\681737903.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_1 = pd.read_sql_query(query_5_1, connection)

         company   cnt
0         Яндекс  1933
1     Ростелеком   491
2       Тинькофф   444
3           СБЕР   428
4  Газпром нефть   331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [93]:
# текст запроса
query_5_2 = f'''select a.name area,
                       count(e.id) employers_cnt,
                       count(v.id) vacancies_cnt
                from public.areas a
                     join public.employers e on e.area = a.id
                     left join public.vacancies v on a.id = v.area_id
                group by a.name
                having count(v.id) = 0
                order by employers_cnt desc
            '''

In [94]:
# результат запроса
result_5_2_df = pd.read_sql_query(query_5_2, connection)
result_5_2_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\1015237798.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_2_df = pd.read_sql_query(query_5_2, connection)

                                          area  employers_cnt  vacancies_cnt
0                                       Россия            410              0
1                                    Казахстан            207              0
2                           Московская область             75              0
3                           Краснодарский край             19              0
4                                     Беларусь             18              0
..                                         ...            ...            ...
181                                    Удобная              1              0
182                Майна (Ульяновская область)              1              0
183                            Верхнетуломский              1              0
184                                    Жаркент              1              0
185  Михайловка (Уфимский район, Башкортостан)              1              0

[186 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [106]:
# текст запроса
query_5_3 = f'''select e.name,
                       count(distinct v.area_id) cnt
                from public.employers e
                     join public.vacancies v on e.id = v.employer_id
                group by e.name
                order by cnt desc
            '''

In [107]:
# результат запроса
result_5_3_df = pd.read_sql_query(query_5_3, connection)
result_5_3_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\1789408357.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_3_df = pd.read_sql_query(query_5_3, connection)

                         name  cnt
0                      Яндекс  181
1                  Ростелеком  152
2                  Спецремонт  116
3      Поляков Денис Иванович   88
4                   ООО ЕФИН    71
...                       ...  ...
14761                  UniSol    1
14762            UNISTORY LLC    1
14763                   UNIT6    1
14764     United Distribution    1
14765              UNITEL LLC    1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [132]:
# текст запроса
query_5_4 = f'''with x as (
                select e.id,
                       count(ei.industry_id) cnt
                from public.employers e
                     left join public.employers_industries ei on e.id = ei.employer_id
                group by e.id
                order by cnt asc
                )
                select count(x.id)
                from x 
                where x.cnt = 0
            '''

In [133]:
# результат запроса
result_5_4 = pd.read_sql_query(query_5_4, connection)
result_5_4

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\2100614959.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_4 = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [148]:
# текст запроса
query_5_5 = f'''select e.id,
                       e.name,
                       count(ei.industry_id) cnt
                from public.employers e
                     join public.employers_industries ei on e.id = ei.employer_id
                group by e.id
                having count(ei.industry_id) = 4
                order by e.name
                offset 2
                limit 1
            '''

In [149]:
# результат запроса
result_5_5 = pd.read_sql_query(query_5_5, connection)
result_5_5

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\3968243757.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_5 = pd.read_sql_query(query_5_5, connection)

      id  name  cnt
0  64174  2ГИС    4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [156]:
# текст запроса
query_5_6 = f'''
                    select count(e.id)
                    from public.employers e
                         join public.employers_industries ei on e.id = ei.employer_id
                         join public.industries i on ei.industry_id = i.id
                    where i.name = 'Разработка программного обеспечения'
            '''

In [157]:
# результат запроса
result_5_6 = pd.read_sql_query(query_5_6, connection)
result_5_6

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\2006184108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_6 = pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [212]:
# код для получения списка городов-милионников
import requests
from bs4 import BeautifulSoup

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'

response = requests.get(url)
page = BeautifulSoup(response.text, 'html.parser')
table = page.find('table', class_='standard')
city = []
city_table = table.find('tbody')
city_rows = tt.find_all('tr')
for i in city_rows:
    name_city = list(i.find('a'))
    city.append(name_city[0])
city = city[1:]
print(city)

['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Красноярск', 'Нижний Новгород', 'Челябинск', 'Уфа', 'Самара', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград']

In [228]:
# текст запроса
query_5_7 = f'''with x as(
                select a.name region,
                       count(v.id) cnt
                from public.vacancies v
                     join public.employers e on e.id = v.employer_id
                     join public.areas a on a.id = v.area_id
                group by e.name, region
                having  e.name = 'Яндекс' and a.name in {tuple(city)}
                )
                select *
                from x
                union
                select 'Total', sum(x.cnt)
                from x
                order by cnt asc
            '''

In [229]:
# результат запроса
result_5_7_df = pd.read_sql_query(query_5_7, connection)
result_5_7_df

C:\Users\vvcha\AppData\Local\Temp\ipykernel_46564\46856131.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_5_7_df = pd.read_sql_query(query_5_7, connection)

             region    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7               Уфа   26.0
8            Самара   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

***

In [ ]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [17]:
# текст запроса
query_6_1 = f'''select
                      count(v.id)
                from public.vacancies v
                where lower(v.name) like '%data%' or lower(v.name) like '%данн%'
            '''

In [18]:
# результат запроса
result_6_1 = pd.read_sql_query(query_6_1, connection)
result_6_1

C:\Users\vvcha\AppData\Local\Temp\ipykernel_18320\110680103.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_1 = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [75]:
# текст запроса
query_6_2 = f'''select
                      count(v.id)
                from public.vacancies v
                where (lower(v.name) similar to '%(data scientist|data science|исследователь данных|ml|machine learning|машинн%обучен)%')  and
                        (lower(v.name) not like '%html%') and
                        (lower(v.name) like '%junior%' or
                        lower(v.experience) like '%нет опыта%' or
                        lower(v.employment) like '%стажировка%')
            '''

In [76]:
# результат запроса
result_6_2 = pd.read_sql_query(query_6_2, connection)
result_6_2

C:\Users\vvcha\AppData\Local\Temp\ipykernel_23476\2753634649.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_2 = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [80]:
# текст запроса
query_6_3 = f'''select
                      count(v.id)
                from public.vacancies v
                where (lower(v.name) similar to '%(data scientist|data science|исследователь данных|ml|machine learning|машинн%обучен)%')  and
                        (lower(v.name) not like '%html%') and
                        (lower(v.key_skills) like '%sql%' or
                        lower(v.key_skills) like '%postgres%')
            '''

In [78]:
# результат запроса
result_6_3 = pd.read_sql_query(query_6_3, connection)
result_6_3

C:\Users\vvcha\AppData\Local\Temp\ipykernel_23476\4098921489.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_3 = pd.read_sql_query(query_6_3, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [81]:
# текст запроса
query_6_4 = f'''select
                      count(v.id)
                from public.vacancies v
                where (lower(v.name) similar to '%(data scientist|data science|исследователь данных|ml|machine learning|машинн%обучен)%')  and
                        (lower(v.name) not like '%html%') and
                        (lower(v.key_skills) like '%python%')
            '''

In [82]:
# результат запроса
result_6_4 = pd.read_sql_query(query_6_4, connection)
result_6_4

C:\Users\vvcha\AppData\Local\Temp\ipykernel_23476\3633921962.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_4 = pd.read_sql_query(query_6_4, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [83]:
# текст запроса
query_6_5 = f'''select
                      v.name,
                      v.key_skills
                from public.vacancies v
                where (lower(v.name) similar to '%(data scientist|data science|исследователь данных|ml|machine learning|машинн%обучен)%')  and
                        (lower(v.name) not like '%html%') and
                        (lower(v.key_skills) like '%python%')
            '''

In [84]:
# результат запроса
result_6_5 = pd.read_sql_query(query_6_5, connection)
result_6_5

C:\Users\vvcha\AppData\Local\Temp\ipykernel_23476\2976042599.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_6_5 = pd.read_sql_query(query_6_5, connection)

,name,key_skills
0,Junior+ CV/ML developer,Python\tSQL\tРабота в команде\tOpenCV\tML
1,Data Scientist,Oracle Pl/SQL\tБазы данных\tMachine Learning\t...
2,Data Scientist (Junior+),Python\tOpenCV\tTensorflow\tComputer Vision\tН...
3,AI/ML Senior Engineer,Python\tFlask\tLinux\tAWS\tGit
4,Data Scientist,Python\tSQL\tNLP\tScikit-learn\tMachine Learning
...,...,...
352,Machine Learning and Computer vision developer,Python\tLinux\tSQL\tPyTorch\tOpenCV\tKeras\tCa...
353,Data scientist / Исследователь-программист данных,Python\tАналитическое мышление\tАнализ данных\...
354,Специалист ML/DS,Python\tNumpy\tPyTorch\tPandas\tМатематический...
355,Data Scientist в области рекомендательных систем,Python\tScikit-learn\tPandas\tGit\tNumpy
356,ML Engineer Team Lead (to Cyprus),Python\tLinux\tKubernetes\tAWS\tGit\tPeople Ma...

In [91]:
a = list(map(lambda x: len(str.split(x, '\t')), result_6_5['key_skills']))
print(a)

[5, 9, 8, 5, 5, 5, 5, 5, 5, 5, 4, 5, 11, 5, 4, 10, 5, 6, 10, 8, 4, 8, 9, 5, 5, 2, 5, 8, 5, 3, 2, 5, 5, 5, 5, 9, 4, 3, 6, 5, 10, 5, 4, 4, 5, 9, 9, 5, 5, 5, 6, 20, 8, 11, 6, 6, 6, 19, 4, 8, 5, 5, 11, 8, 7, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 3, 5, 5, 8, 4, 4, 4, 4, 17, 5, 5, 14, 15, 7, 5, 5, 8, 4, 5, 5, 5, 4, 4, 5, 5, 3, 5, 6, 14, 3, 8, 8, 12, 7, 15, 3, 3, 3, 11, 8, 5, 7, 7, 7, 7, 10, 2, 14, 14, 5, 2, 5, 5, 5, 5, 8, 3, 6, 16, 9, 5, 11, 2, 6, 12, 6, 5, 6, 6, 12, 12, 7, 9, 8, 6, 5, 12, 10, 14, 7, 6, 19, 19, 11, 6, 5, 3, 1, 5, 8, 2, 3, 5, 6, 7, 5, 12, 10, 5, 5, 5, 9, 5, 15, 6, 4, 6, 10, 5, 4, 6, 15, 5, 4, 14, 5, 4, 8, 13, 5, 5, 5, 5, 5, 5, 6, 5, 3, 12, 5, 5, 7, 12, 12, 7, 3, 4, 6, 6, 9, 8, 5, 8, 7, 6, 3, 9, 12, 9, 6, 5, 6, 6, 6, 6, 8, 4, 3, 7, 8, 6, 5, 4, 4, 5, 6, 6, 8, 8, 12, 5, 3, 5, 8, 6, 8, 6, 5, 5, 6, 4, 4, 9, 5, 5, 5, 6, 8, 6, 4, 5, 5, 7, 5, 5, 7, 2, 14, 7, 5, 6, 5, 5, 8, 4, 5, 5, 3, 5, 6, 5, 11, 6, 6, 5, 5, 6, 11, 5, 11, 8, 8, 2, 5, 5, 4, 5, 6, 3, 13, 13, 5, 6, 6, 5, 6, 7, 7, 8, 5, 5, 9, 8, 5, 6, 6, 11, 5, 5, 5, 7, 5, 5, 14, 5, 11, 5, 4, 4, 9, 5, 11, 11, 5, 10, 2, 8, 5, 6, 8, 5, 6, 6, 6, 8, 7, 9, 5, 6]

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
# текст запроса

In [ ]:
# результат запроса

***

In [ ]:
# выводы по предметному анализу

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования